# YOLOv8s-XH 廉江红橙专用模型配置
#
# 在 YOLOv8s 基础上的定制点：
#   1) nc=12        12 类病虫害（对应 xhgan/config.py DISEASE_CLASSES）
#   2) P2 head      新增 stride=4 输出头，强化红蜘蛛 / 木虱若虫等小目标
#   3) 锚框自适应   Anchor-Free，无需手工锚框
#
# 使用：
#   yolo detect train \
#       data=lianjiang_hongcheng_dataset/data.yaml \
#       model=tools/yolov8s_xh.yaml \
#       pretrained=yolov8s.pt \
#       epochs=300 imgsz=640 batch=16

nc: 12   # 12 类廉江红橙病虫害
scales:
  s: [0.33, 0.50, 1024]   # depth, width, max_channels

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]      # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]     # 1  P2/4   ← 小目标关键
  - [-1, 3, C2f,   [128, True]]
  - [-1, 1, Conv,  [256, 3, 2]]     # 3  P3/8
  - [-1, 6, C2f,   [256, True]]
  - [-1, 1, Conv,  [512, 3, 2]]     # 5  P4/16
  - [-1, 6, C2f,   [512, True]]
  - [-1, 1, Conv,  [1024, 3, 2]]    # 7  P5/32
  - [-1, 3, C2f,   [1024, True]]
  - [-1, 1, SPPF,  [1024, 5]]       # 9

head:
  # ---------- P5 -> P4 ----------
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]              # 12 (P4/16)

  # ---------- P4 -> P3 ----------
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]              # 15 (P3/8)

  # ---------- P3 -> P2 （小目标专项 head） ----------
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]              # 18 (P2/4) ★ 新增小目标层

  # ---------- 向下回流 ----------
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]              # 21 (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]              # 24 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]             # 27 (P5/32)

  # Detect 接 4 个尺度：P2, P3, P4, P5
  - [[18, 21, 24, 27], 1, Detect, [nc]]
